#+startup: overview
#+options: toc:nil
#+options: hideblocks
* C Fundamentals Practice Workbook

  * See King, chapter 2, C Fundamentals (pp. 9-36)
  * Page numbers "N:M" refer to book:[[https://docs.google.com/presentation/d/14qvh00aVb_R09_hrQY0EDEK_JLAkgZ0S/edit?usp=sharing&ouid=102963037093118135110&rtpof=true&sd=true][slides (GDrive)]] pages
  
** Comments (15:19)
   
   Forgetting to terminate a comment may cause the compiler to ignore
   part of your program - but both syntax highlighting and auto-indent
   in the editor will tip you off:
  
   #+begin_src C :exports both :main yes :includes stdio.h

     printf("My "); /* forgot to close this comment ...
		       printf("cat ");
		       printf("has ");  /* so it ends here */
     printf("fleas");

  #+end_src

  #+RESULTS:
  : My fleas

